Revit 2024 API
TemporaryViewModes.IsModeActive Method
 Tests whether a given mode is currently active or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public bool IsModeActive(
	TemporaryViewMode mode
)
Visual Basic
Public Function IsModeActive ( _
	mode As TemporaryViewMode _
) As Boolean
Visual C++
public:
bool IsModeActive(
	TemporaryViewMode mode
)
Parameters
mode
Type: Autodesk.Revit.DB.TemporaryViewMode
 The mode being tested
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace